# Callback Errors
NO_DATA = 1
UNKNOWN_METHOD = 2
INVALID_DATA = 3
UNBIND_CHAT = 4
CANT_BIND_CHAT = 10

# API Errors
VK_ERROR = {
    1: "Произошла неизвестная ошибка.",
    2: "Приложение выключено.",
    3: "Передан неизвестный метод",
    4: "Неверная подпись.",
    5: "Авторизация пользователя не удалась.",
    6: "Слишком много запросов в секунду.",
    7: "Нет прав для выполнения этого действия.",
    8: "Неверный запрос",
    9: "Слишком много однотипных действий.",
    10: "Произошла внутренняя ошибка сервера.",
    12: "Невозможно скомпилировать код.",
    13: "Ошибка выполнения кода.",
    14: "Требуется ввод кода с картинки (Captcha).",
    15: "Доступ запрещён",
    18: "Страница удалена или заблокирована.",
    23: "Метод был выключен.",
    28: "Ключ доступа приложения недействителен.",
    29: "Достигнут количественный лимит на вызов метода.",
    100: "Один из необходимых параметров был не передан или не верен.",
    103: "Превышено ограничение на количество участников в беседе.",
    113: "Неверный идентификатор пользователя.",
    174: "Невозможно добавить в друзья самого себя.",
    175: "Невозможно добавить в друзья пользователя, который занес Вас в свой черный список.",
    176: "Невозможно добавить в друзья пользователя, который занесен в Ваш черный список.",
    177: "Пользователь не найден.",
    900: "Нельзя отправлять сообщение пользователю из черного списка.",
    902: "Нельзя отправлять сообщения этому пользователю в связи с настройками приватности.",
    909: "Невозможно отредактировать сообщение после 24 часов.",
    910: "Невозможно отредактировать сообщение, поскольку оно слишком большое.",
    913: "Слишком много пересланных сообщений.",
    914: "Сообщение слишком длинное.",
    915: "У вас нет доступа в эту беседу.",
    917: "Нет доступа к беседе.",
    920: "Невозможно отредактировать сообщение такого типа.",
    921: "Невозможно переслать выбранные сообщения.",
    924: "Невозможно удалить сообщение для пользователей.",
    925: "Вы не являетесь админом в этом чате.",
    927: "Чат не существует.",
    935: "Такого пользователя в чате нет.",
    936: "Контакт не найден.",
    939: "Запрос уже был отправлен.",
    945: "Чат был отключен.",
    946: "Чат не поддерживается.",
    947: "Не могу добавить пользователя в чат, нет доступа к группе."
}