from .utils import msg_op
from . import dlp
import time

animation_names = ('бан', 'цем', 'поддержка', 'помощь', 'под',
'мол', 'дорога', 'дрг', 'секс', 'бб', 'брак', 'удар', 'полиция', 'пнуть',
'свидание', 'вселенная', 'привет', 'пока', 'письмо', 'смерть', 'на',
'пожалуйста', 'накормить', 'пошел', 'бух', 'поцеловать', 'выстрел',
'зарплата', 'зп', 'бомба', 'таймер', 'ф', 'f', 'ъуъ', 'луна')

@dlp.register(*animation_names)
def animations(nd):
    nd[5] = nd.msg['command']
    
    
    if nd[5] == 'ф' or nd[5] == 'f':
        picl = ['🌕🌗🌑🌑🌑🌑🌑🌓🌕','🌕🌗🌑🌑🌑🌑🌑🌕🌕','🌕🌗🌑🌓🌕🌕🌕🌕🌕','🌕🌗🌑🌓🌕🌕🌕🌕🌕',
        '🌕🌗🌑🌑🌑🌑🌓🌕🌕','🌕🌗🌑🌑🌑🌑🌕🌕🌕','🌕🌗🌑🌓🌕🌕🌕🌕🌕','🌕🌗🌑🌓🌕🌕🌕🌕🌕','🌕🌗🌑🌓🌕🌕🌕🌕🌕']
        pic0 = picl[0]
        pic1 = picl[1]
        pic2 = picl[2]
        pic3 = picl[3]
        pic4 = picl[4]
        pic5 = picl[5]
        pic6 = picl[6]
        pic7 = picl[7]
        pic8 = picl[8]

        for i in range(10):
            msg_op(2, nd[3], f'''{pic0}\n{pic1}\n{pic2}\n{pic3}\n{pic4}
            {pic5}\n{pic6}\n{pic7}\n{pic8}'''.replace('    ', ''), nd[1], keep_forward_messages = 1)
            pic0 = pic0[-1:] + pic0[:-1]
            pic1 = pic1[-1:] + pic1[:-1]
            pic2 = pic2[-1:] + pic2[:-1]
            pic3 = pic3[-1:] + pic3[:-1]
            pic4 = pic4[-1:] + pic4[:-1]
            pic5 = pic5[-1:] + pic5[:-1]
            pic6 = pic6[-1:] + pic6[:-1]
            pic7 = pic7[-1:] + pic7[:-1]
            pic8 = pic8[-1:] + pic8[:-1]
            time.sleep(0.8)
        return "ok"


    if nd[5] == 'луна':
        msg_op(2, nd[3],'⚠ Не в этом дежурном', nd[1])
        time.sleep(3)
        msg_op(2, nd[3],'Ладно, хорошо, так уж и быть...', nd[1], keep_forward_messages = 1)
        time.sleep(2)
        pic = '🌑🌒🌓🌔🌕🌖🌗🌘'
        for i in range(9):
            msg_op(2, nd[3], f'{pic}', nd[1])
            pic = pic[-1:] + pic[:-1]
            time.sleep(1)
        return "ok"


    if nd[5] == 'ъуъ':
        picl = [
    '🌕🌕🌕🌕🌕🌕🌕🌕🌕🌕','🌕🌕🌕🌕🌕🌕🌕🌕🌕🌕','🌘🌑🌕🌕🌘🌑🌒🌕🌕🌕',
    '🌑🌕🌕🌘🌑🌑🌑🌓🌕🌕','🌘🌔🌖🌑👁🌑👁🌓🌗🌒','🌖🌓🌗🌑🌑🌑🌑🌔🌕🌑',
    '🌕🌗🌑🌑🌑🌑🌒🌕🌘🌒','🌕🌕🌘🌑🌑🌑🌑🌑🌒🌕','🌕🌕🌘🌑🌑🌑🌔🌕🌕🌕',
    '🌕🌕🌘🌔🌘🌑🌕🌕🌕🌕','🌕🌖🌒🌕🌗🌒🌕🌕🌕🌕','🌕🌗🌓🌕🌗🌓🌕🌕🌕🌕']
        pic0 = picl[0]
        pic1 = picl[1]
        pic2 = picl[2]
        pic3 = picl[3]
        pic4 = picl[4]
        pic5 = picl[5]
        pic6 = picl[6]
        pic7 = picl[7]
        pic8 = picl[8]
        pic9 = picl[9]
        pic10 = picl[10]
        pic11 = picl[11]

        for i in range(11):
            msg_op(2, nd[3], f'''{pic0}\n{pic1}\n{pic2}\n{pic3}\n{pic4}\n{pic5}\n{pic6}
            {pic7}\n{pic8}\n{pic9}\n{pic10}\n{pic11}'''.replace('    ', ''), nd[1], keep_forward_messages = 1)
            pic0 = pic0[-1:] + pic0[:-1]
            pic1 = pic1[-1:] + pic1[:-1]
            pic2 = pic2[-1:] + pic2[:-1]
            pic3 = pic3[-1:] + pic3[:-1]
            pic4 = pic4[-1:] + pic4[:-1]
            pic5 = pic5[-1:] + pic5[:-1]
            pic6 = pic6[-1:] + pic6[:-1]
            pic7 = pic7[-1:] + pic7[:-1]
            pic8 = pic8[-1:] + pic8[:-1]
            pic9 = pic9[-1:] + pic9[:-1]
            pic10 = pic10[-1:] + pic10[:-1]
            pic11 = pic11[-1:] + pic11[:-1]
            time.sleep(0.8)
        return "ok"

    pic = 0

    if nd[5] == 'бан':
        pic = ["😒    😈","😒⚠    😈","😒 ⚠   😈","😒  ⚠  😈","😒   ⚠ 😈","😏 👿"]


    if nd[5] == 'цем':
        pic = ['😚 ❤ ᅠᅠᅠᅠᅠ 😔 ','😚 ᅠ ❤ ᅠᅠᅠᅠ 😔 ','😚 ᅠᅠ ❤ ᅠᅠᅠ 😔 ','😚 ᅠᅠᅠ ❤ ᅠᅠ 😔 ',
        '😚 ᅠᅠᅠᅠ ❤ ᅠ 😔 ','😚 ᅠᅠᅠᅠᅠᅠ ❤ 😔 ','😚 ᅠᅠᅠᅠᅠᅠ ☺ ','😊 ☺ ']


    if nd[5] in {'поддержка', 'помощь', 'под'}:
        pic = ["😉     😔 ","😉👍    😔 ","😉 👍   😔 ",
        "😉  👍  😔 ","😉   👍 😔 ","😉    👍😨 ","😉👍😊"]


    if nd[5] == 'мол':
        pic = ["😍     😔 ","😍 ❤   😔 ","😍  ❤  😔 ","😍   ❤ 😳 ","😍    ❤😍 ","😘🤗",]


    if nd[5] == 'дорога' or nd[5] == 'дрг':
        pic = ["🛤\n🛤\n🛤\n🛤\n🛤","🚆\n🛤\n🛤\n🛤\n🛤","🛤\n🚆\n🛤\n🛤\n🛤",
        "🛤\n🛤\n🚆\n🛤\n🛤","🛤\n🛤\n🛤\n🚆\n🛤","🛤\n🛤\n🛤\n🛤\n🚆","🛤\n🛤\n🛤\n🛤\n🛤"]


    if nd[5] == 'бб':
        pic = ["😔      😆","😢      😆","😕      😂",
        "🙂👉   😮","🙂👉🔥😣","😂     😵"]


    if nd[5] == 'секс':
        pic = ["😶     😶","😍     😍","😍👉   👌😍","😍 👉 👌 😍",
        "😍  👉👌 😍","😍 👉 👌 😍","🤤     🤤"]


    if nd[5] == 'брак':
        pic = ["🙋   🏃","💁💕  🚶","🙎  🎁🙇","🙎🎁  🙇","🙆💍 🎁🙇",
        " 💕💏💕","💕 💑 💕","👫   ⛪","👫  ⛪","👫 ⛪","👫💒"]


    if nd[5] == 'удар':
        pic = ["😔     🤣","😤     😂","😡🤜    🤣",
        "😡 🤜   😂","😡  🤜  🤣","😡   🤜 🤣","😡    🤜😣","😌     😵"]


    if nd[5] == 'полиция':
        pic = ["     🚓","    🚓","   🚓","  🚓"," 🚓","🚓",]


    if nd[5] == 'пнуть':
        pic = ["😑👟     🤔","😑 👟    🤔","😑  👟   🤔","😑   👟  🤔","😑    👟 🤔","😏     👟🤕"]


    if nd[5] == 'свидание':
        pic = ["💃    🕺"," 💃  🕺 ","  💃🕺  ","  👫 🌇","   👫🌇","   💑🌇","   💏🌇"]


    if nd[5] == 'вселенная':
        pic = ["🌑✨✨🌏✨✨✨","✨🌑✨🌍✨✨✨","✨✨🌑🌎✨✨✨",
        "✨✨✨🌏🌕✨✨","✨✨✨🌍✨🌕✨","✨✨✨🌎✨✨🌕"]


    if nd[5] == 'привет':
        pic = ["😄🖐","😄👋","😄🖐","😄👋","😄🖐","😄👋"]


    if nd[5] == 'пока':
        pic = ["😁🖐 ","😐👋 ","😕🖐 ","😔👋 ","😔✋ ","😔👋 ","😔✋"]


    if nd[5] == 'письмо':
        pic = ["😊💬         😔","😊  💬       😔","😊    💬     😔",
        "😊      💬   😔","😊         💬😔","😊         😃"]


    if nd[5] == 'смерть':
        pic = ["🙁     😎","😤     😎","😡🔪    😎",
        "😡 🔪   😯","😡  🔪  😧","😡   🔪 😧","😡    🔪😩","😁     😵"]


    if nd[5] == 'на':
        if nd.msg['args'].get(0) == 'попей':
            pic = ["🙂      🙂","😦      🙂","😯      🙂","😗💦     🙂","😗 💦    🙂",
            "😗  💦   🤔","😗   💦  😳","😁    💦 😦","😂     💦😪","😈      😵"]


    if nd[5] == 'пожалуйста':
        pic = ["🤓     🤔","🤓    🚶","🤓   🚶","🤓  😦","🤓 🚶","🤓🤔","🗣😏","🤝"]


    if nd[5] == 'накормить':
        pic = ["🤔     😒","🤔🍔    😒","😊 🍔   😒","😊  🍔  😲","😊   🍔 😲","😁    🍔🤤","😌🍔😋"]


    if nd[5] == 'пошел':
        if nd.msg['args'].get(0) == 'нахуй':
            pic = ["😔      🤣","😡    🤣","😡 🖕    🤣","😏     😢","🤣     😭"]


    if nd[5] == 'бух':
        pic = ["😋    🍾", "😄   🍾","😁  🍾","🤤 🍾","🤢","🤮"]


    if nd[5] == 'поцеловать':
        pic = ["😺     🙄","😺    🙄","😺   🙄","😺  🙄","😺 🙄","😺🙄","😽😍"]



    if nd[5] == 'выстрел':
        pic = ["😏 😣","😂 🔫😡","😨 • 🔫😡","😵💥 🔫😡"]



    if nd[5] == 'зарплата' or nd[5] == 'зп':
        pic = ["😔     🙋‍♂", "😔     💁‍♂💵","😔    💵💁‍♂","😔   💵💁‍♂",
        "😔  💵💁‍♂","😔 💵💁‍♂", "😔💵💁‍♂", "😔💵🙋‍♂", "😦💵","😁💵" ]



    if nd[5] == 'бомба':
        pic = ['😠        😝','😡        😝','😡👉💣     😝','😡 👉💣   😝','😡  👉💣   😝',
        '😡   👉💣  😝','😡    👉💣 😝','😡     👉💣😝','😌     👉💣💀']



    if nd[5] == 'таймер':
        pic = ['🔟','9️⃣','8️⃣','7️⃣','6️⃣','5️⃣','4️⃣','3️⃣','2️⃣','1️⃣','✅ Время вышло ✅',]


    if pic:
        for i in range(len(pic)):
            msg_op(2, nd[3], f'{pic[i]}', nd[1], keep_forward_messages = 1)
            time.sleep(1)
    return "ok"