"""



"""

errors = {
    1: {"response": "error", "error_code": 1},
    2: {"response": "error", "error_code": 2},
    3: {"response": "error", "error_code": 3},
    925: '⚠ Не могу добавить пользователя, так как не являюсь администратором в чате.',
    103: '⚠ Не могу добавить пользователя, так как чат полон.',
    15: '⚠ Не могу добавить. Скорее всего пользователь не в моих друзьях.',
    924: '⚠ Не могу удалить сообщения, возможно у меня нет прав администратора в чате, либо они есть у пользователя.',
    921: '⚠ Не могу переслать выбранные сообщения.'
}

SETTINGS_PATH = "dutymanager/core/settings.json"
